app/Controllers/User.php

SELECT *
FROM `tb_user`
WHERE `tb_user`.`customer` = 'kinax'
---
    public function cek()
{
    $customer = $this->request->getPost('customer');
    $password = $this->request->getPost('password');

    $userModel = new UserModel();
    $userData = $userModel->find($customer);