app/Models/PlaceModel.php

    public function getAllData()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('tb_place');
        return $builder->get()->getResult();
---
SELECT *
FROM `tb_place`

    public function getDataById($id)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('tb_place');
        $builder->where('id_place', $id);
        return $builder->get()->getRow();
---
SELECT *
FROM `tb_place`
WHERE `id_place` = 'ID100'