app/Models/TransaksiModel.php

SELECT `tb_transaksi`.*, `tb_place`.`id_place`, `tb_place`.`jenis`, `tb_place`.`name_place`, `tb_user`.`customer`
FROM `tb_transaksi`
JOIN `tb_place` ON `tb_place`.`id_place` = `tb_transaksi`.`id_place`
JOIN `tb_user` ON `tb_user`.`customer` = `tb_transaksi`.`customer`
---
    public function getAllDataWithRelation()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('tb_transaksi');

        $result = $builder
            ->select('tb_transaksi.*, tb_place.id_place, tb_place.jenis, tb_place.name_place, tb_user.customer')
            ->join('tb_place', 'tb_place.id_place = tb_transaksi.id_place')
            ->join('tb_user', 'tb_user.customer = tb_transaksi.customer')
            ->get()
            ->getResult();

INSERT INTO `tb_transaksi` (`id_transaksi`, `id_place`, `customer`, `metode`, `jumlah`, `tanggal`) VALUES ('', 'ID100', 'Kinax', 'PayPal', '70000', '2024-06-13')
---
    public function insertData($data)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('tb_transaksi');
        return $builder->insert($data);